bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
/*
  web_server.cpp -  web server functions class

  Copyright (c) 2014 Luc Lebosse. All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "grbl.h"

#if defined(ENABLE_WIFI) && defined(ENABLE_HTTP)

#    include "wifiservices.h"

#    include "espresponse.h"
#    include "serial2socket.h"
#    include "web_server.h"
#    include <WebSocketsServer.h>
#    include <WiFi.h>
#    include <FS.h>
#    include <SPIFFS.h>
#    ifdef ENABLE_SD_CARD
#        include <SD.h>
#        include "grbl_sd.h"
#    endif
#    include <WebServer.h>
#    include <ESP32SSDP.h>
#    include <StreamString.h>
#    include <Update.h>
#    include <esp_wifi_types.h>
#    ifdef ENABLE_MDNS
#        include <ESPmDNS.h>
#    endif
#    ifdef ENABLE_SSDP
#        include <ESP32SSDP.h>
#    endif
#    ifdef ENABLE_CAPTIVE_PORTAL
#        include <DNSServer.h>
const byte DNS_PORT = 53;
DNSServer  dnsServer;
#    endif
#    include <esp_ota_ops.h>

//embedded response file if no files on SPIFFS
#    include "nofile.h"

//Upload status
typedef enum {
    UPLOAD_STATUS_NONE       = 0,
    UPLOAD_STATUS_FAILED     = 1,
    UPLOAD_STATUS_CANCELLED  = 2,
    UPLOAD_STATUS_SUCCESSFUL = 3,
    UPLOAD_STATUS_ONGOING    = 4
} upload_status_type;

//Default 404
const char PAGE_404[] =
    "<HTML>\n<HEAD>\n<title>Redirecting...</title> \n</HEAD>\n<BODY>\n<CENTER>Unknown page : $QUERY$- you will be "
    "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
    "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
    "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
    "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";
const char PAGE_CAPTIVE[] =
    "<HTML>\n<HEAD>\n<title>Captive Portal</title> \n</HEAD>\n<BODY>\n<CENTER>Captive Portal page : $QUERY$- you will be "
    "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
    "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
    "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
    "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";

//error codes fo upload
#    define ESP_ERROR_AUTHENTICATION 1
#    define ESP_ERROR_FILE_CREATION 2
#    define ESP_ERROR_FILE_WRITE 3
#    define ESP_ERROR_UPLOAD 4
#    define ESP_ERROR_NOT_ENOUGH_SPACE 5
#    define ESP_ERROR_UPLOAD_CANCELLED 6
#    define ESP_ERROR_FILE_CLOSE 7
#    define ESP_ERROR_NO_SD 8

Web_Server        web_server;
bool              Web_Server::_setupdone     = false;
uint16_t          Web_Server::_port          = 0;
long              Web_Server::_id_connection = 0;
uint8_t           Web_Server::_upload_status = UPLOAD_STATUS_NONE;
WebServer*        Web_Server::_webserver     = NULL;
WebSocketsServer* Web_Server::_socket_server = NULL;
#    ifdef ENABLE_AUTHENTICATION
auth_ip* Web_Server::_head  = NULL;
uint8_t  Web_Server::_nb_ip = 0;
#        define MAX_AUTH_IP 10
#    endif
Web_Server::Web_Server() {}
Web_Server::~Web_Server() {
    end();
}

long Web_Server::get_client_ID() {
    return _id_connection;
}

bool Web_Server::begin() {
    bool no_error = true;
    _setupdone    = false;
    if (http_enable->get() == 0) {
        return false;
    }
    _port = http_port->get();

    //create instance
    _webserver = new WebServer(_port);
#    ifdef ENABLE_AUTHENTICATION
    //here the list of headers to be recorded
    const char* headerkeys[]   = { "Cookie" };
    size_t      headerkeyssize = sizeof(headerkeys) / sizeof(char*);
    //ask server to track these headers
    _webserver->collectHeaders(headerkeys, headerkeyssize);
#    endif
    _socket_server = new WebSocketsServer(_port + 1);
    _socket_server->begin();
    _socket_server->onEvent(handle_Websocket_Event);

    //Websocket output
    Serial2Socket.attachWS(_socket_server);

    //events functions
    //_web_events->onConnect(handle_onevent_connect);
    //events management
    // _webserver->addHandler(_web_events);

    //Websocket function
    //_web_socket->onEvent(handle_Websocket_Event);
    //Websocket management
    //_webserver->addHandler(_web_socket);

    //Web server handlers
    //trick to catch command line on "/" before file being processed
    _webserver->on("/", HTTP_ANY, handle_root);

    //Page not found handler
    _webserver->onNotFound(handle_not_found);

    //need to be there even no authentication to say to UI no authentication
    _webserver->on("/login", HTTP_ANY, handle_login);

    //web commands
    _webserver->on("/command", HTTP_ANY, handle_web_command);
    _webserver->on("/command_silent", HTTP_ANY, handle_web_command_silent);

    //SPIFFS
    _webserver->on("/files", HTTP_ANY, handleFileList, SPIFFSFileupload);

    //web update
    _webserver->on("/updatefw", HTTP_ANY, handleUpdate, WebUpdateUpload);

#    ifdef ENABLE_SD_CARD
    //Direct SD management
    _webserver->on("/upload", HTTP_ANY, handle_direct_SDFileList, SDFile_direct_upload);
    //_webserver->on("/SD", HTTP_ANY, handle_SDCARD);
#    endif

#    ifdef ENABLE_CAPTIVE_PORTAL
    if (WiFi.getMode() == WIFI_AP) {
        // if DNSServer is started with "*" for domain name, it will reply with
        // provided IP to all DNS request
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        grbl_send(CLIENT_ALL, "[MSG:Captive Portal Started]\r\n");
        _webserver->on("/generate_204", HTTP_ANY, handle_root);
        _webserver->on("/gconnectivitycheck.gstatic.com", HTTP_ANY, handle_root);
        //do not forget the / at the end
        _webserver->on("/fwlink/", HTTP_ANY, handle_root);
    }
#    endif

#    ifdef ENABLE_SSDP
    //SSDP service presentation
    if (WiFi.getMode() == WIFI_STA) {
        _webserver->on("/description.xml", HTTP_GET, handle_SSDP);
        //Add specific for SSDP
        SSDP.setSchemaURL("description.xml");
        SSDP.setHTTPPort(_port);
        SSDP.setName(wifi_config.Hostname());
        SSDP.setURL("/");
        SSDP.setDeviceType("upnp:rootdevice");
        /*Any customization could be here
        SSDP.setModelName (ESP32_MODEL_NAME);
        SSDP.setModelURL (ESP32_MODEL_URL);
        SSDP.setModelNumber (ESP_MODEL_NUMBER);
        SSDP.setManufacturer (ESP_MANUFACTURER_NAME);
        SSDP.setManufacturerURL (ESP_MANUFACTURER_URL);
        */

        //Start SSDP
        grbl_send(CLIENT_ALL, "[MSG:SSDP Started]\r\n");
        SSDP.begin();
    }
#    endif
    grbl_send(CLIENT_ALL, "[MSG:HTTP Started]\r\n");
    //start webserver
    _webserver->begin();
#    ifdef ENABLE_MDNS
    //add mDNS
    if (WiFi.getMode() == WIFI_STA) {
        MDNS.addService("http", "tcp", _port);
    }
#    endif
    _setupdone = true;
    return no_error;
}

void Web_Server::end() {
    _setupdone = false;
#    ifdef ENABLE_SSDP
    SSDP.end();
#    endif  //ENABLE_SSDP
#    ifdef ENABLE_MDNS
    //remove mDNS
    mdns_service_remove("_http", "_tcp");
#    endif
    if (_socket_server) {
        delete _socket_server;
        _socket_server = NULL;
    }
    if (_webserver) {
        delete _webserver;
        _webserver = NULL;
    }
#    ifdef ENABLE_AUTHENTICATION
    while (_head) {
        auth_ip* current = _head;
        _head            = _head->_next;
        delete current;
    }
    _nb_ip = 0;
#    endif
}

