bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
void Web_Server::_handle_web_command(bool silent) {
    //to save time if already disconnected
    //if (_webserver->hasArg ("PAGEID") ) {
    //    if (_webserver->arg ("PAGEID").length() > 0 ) {
    //       if (_webserver->arg ("PAGEID").toInt() != _id_connection) {
    //       _webserver->send (200, "text/plain", "Invalid command");
    //       return;
    //       }
    //    }
    //}
    auth_t auth_level = is_authenticated();
    String cmd        = "";
    if (_webserver->hasArg("plain")) {
        cmd = _webserver->arg("plain");
    } else if (_webserver->hasArg("commandText")) {
        cmd = _webserver->arg("commandText");
    } else {
        _webserver->send(200, "text/plain", "Invalid command");
        return;
    }
    //if it is internal command [ESPXXX]<parameter>
    cmd.trim();
    int ESPpos = cmd.indexOf("[ESP");
    if (ESPpos > -1) {
        char line[256];
        strncpy(line, cmd.c_str(), 255);
        ESPResponseStream* espresponse = silent ? NULL : new ESPResponseStream(_webserver);
        err_t              err         = system_execute_line(line, espresponse, auth_level);
        String             answer;
        if (err == STATUS_OK) {
            answer = "ok";
        } else {
            const char* msg = errorString(err);
            answer          = "Error: ";
            if (msg) {
                answer += msg;
            } else {
                answer += err;
            }
        }
        if (silent || !espresponse->anyOutput()) {
            _webserver->send(err ? 401 : 200, "text/plain", answer.c_str());
        } else {
            espresponse->flush();
        }
    } else {  //execute GCODE
        if (auth_level == LEVEL_GUEST) {
            _webserver->send(401, "text/plain", "Authentication failed!\n");
            return;
        }
        //Instead of send several commands one by one by web  / send full set and split here
        String      scmd;
        const char* res    = "";
        uint8_t     sindex = 0;
        // TODO Settings - this is very inefficient.  get_Splited_Value() is O(n^2)
        // when it could easily be O(n).  Also, it would be just as easy to push
        // the entire string into Serial2Socket and pull off lines from there.
        for (uint8_t sindex = 0; (scmd = get_Splited_Value(cmd, '\n', sindex)) != ""; sindex++) {
            // 0xC2 is an HTML encoding prefix that, in UTF-8 mode,
            // precede 0x90 and 0xa0-0bf, which are GRBL realtime commands.
            // There are other encodings for 0x91-0x9f, so I am not sure
            // how - or whether - those commands work.
            // Ref: https://www.w3schools.com/tags/ref_urlencode.ASP
            if (!silent && (scmd.length() == 2) && (scmd[0] == 0xC2)) {
                scmd[0] = scmd[1];
                scmd.remove(1, 1);
            }
            if (scmd.length() > 1)
                scmd += "\n";
            else if (!is_realtime_cmd(scmd[0]))
                scmd += "\n";
            if (!Serial2Socket.push(scmd.c_str()))
                res = "Error";
        }
        _webserver->send(200, "text/plain", res);
    }
}

//login status check
void Web_Server::handle_login() {
#    ifdef ENABLE_AUTHENTICATION
    String smsg;
    String sUser, sPassword;
    String auths;
    int    code            = 200;
    bool   msg_alert_error = false;
    //disconnect can be done anytime no need to check credential
    if (_webserver->hasArg("DISCONNECT")) {
        String cookie = _webserver->header("Cookie");
        int    pos    = cookie.indexOf("ESPSESSIONID=");
        String sessionID;
        if (pos != -1) {
            int pos2  = cookie.indexOf(";", pos);
            sessionID = cookie.substring(pos + strlen("ESPSESSIONID="), pos2);
        }
        ClearAuthIP(_webserver->client().remoteIP(), sessionID.c_str());
        _webserver->sendHeader("Set-Cookie", "ESPSESSIONID=0");
        _webserver->sendHeader("Cache-Control", "no-cache");
        String buffer2send = "{\"status\":\"Ok\",\"authentication_lvl\":\"guest\"}";
        _webserver->send(code, "application/json", buffer2send);
        //_webserver->client().stop();
        return;
    }

    auth_t auth_level = is_authenticated();
    if (auth_level == LEVEL_GUEST)
        auths = "guest";
    else if (auth_level == LEVEL_USER)
        auths = "user";
    else if (auth_level == LEVEL_ADMIN)
        auths = "admin";
    else
        auths = "???";

    //check is it is a submission or a query
    if (_webserver->hasArg("SUBMIT")) {
        //is there a correct list of query?
        if (_webserver->hasArg("PASSWORD") && _webserver->hasArg("USER")) {
            //USER
            sUser = _webserver->arg("USER");
            if (!((sUser == DEFAULT_ADMIN_LOGIN) || (sUser == DEFAULT_USER_LOGIN))) {
                msg_alert_error = true;
                smsg            = "Error : Incorrect User";
                code            = 401;
            }
            if (msg_alert_error == false) {
                //Password
                sPassword             = _webserver->arg("PASSWORD");
                String sadminPassword = admin_password->get();
                String suserPassword  = user_password->get();

                if (!(((sUser == DEFAULT_ADMIN_LOGIN) && (strcmp(sPassword.c_str(), sadminPassword.c_str()) == 0)) ||
                      ((sUser == DEFAULT_USER_LOGIN) && (strcmp(sPassword.c_str(), suserPassword.c_str()) == 0)))) {
                    msg_alert_error = true;
                    smsg            = "Error: Incorrect password";
                    code            = 401;
                }
            }
        } else {
            msg_alert_error = true;
            smsg            = "Error: Missing data";
            code            = 500;
        }
        //change password
        if (_webserver->hasArg("PASSWORD") && _webserver->hasArg("USER") && _webserver->hasArg("NEWPASSWORD") && (msg_alert_error == false)) {
            String newpassword = _webserver->arg("NEWPASSWORD");
            if (COMMANDS::isLocalPasswordValid((char*)newpassword.c_str())) {
                err_t err;
                if (sUser == DEFAULT_ADMIN_LOGIN) {
                    err = admin_password->setStringValue((char*)newpassword.c_str());
                } else {
                    err = user_password->setStringValue((char*)newpassword.c_str());
                }
                if (err) {
                    msg_alert_error = true;
                    smsg            = "Error: Cannot apply changes";
                    code            = 500;
                }
            } else {
                msg_alert_error = true;
                smsg            = "Error: Incorrect password";
                code            = 500;
            }
        }
        if ((code == 200) || (code == 500)) {
            auth_t current_auth_level;
            if (sUser == DEFAULT_ADMIN_LOGIN) {
                current_auth_level = LEVEL_ADMIN;
            } else if (sUser == DEFAULT_USER_LOGIN) {
                current_auth_level = LEVEL_USER;
            } else {
                current_auth_level = LEVEL_GUEST;
            }
            //create Session
            if ((current_auth_level != auth_level) || (auth_level == LEVEL_GUEST)) {
                auth_ip* current_auth = new auth_ip;
                current_auth->level   = current_auth_level;
                current_auth->ip      = _webserver->client().remoteIP();
                strcpy(current_auth->sessionID, create_session_ID());
                strcpy(current_auth->userID, sUser.c_str());
                current_auth->last_time = millis();
                if (AddAuthIP(current_auth)) {
                    String tmps = "ESPSESSIONID=";
                    tmps += current_auth->sessionID;
                    _webserver->sendHeader("Set-Cookie", tmps);
                    _webserver->sendHeader("Cache-Control", "no-cache");
                    switch (current_auth->level) {
                        case LEVEL_ADMIN: auths = "admin"; break;
                        case LEVEL_USER: auths = "user"; break;
                        default: auths = "guest"; break;
                    }
                } else {
                    delete current_auth;
                    msg_alert_error = true;
                    code            = 500;
                    smsg            = "Error: Too many connections";
                }
            }
        }
        if (code == 200)
            smsg = "Ok";

