bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
        //build  JSON
        String buffer2send = "{\"status\":\"" + smsg + "\",\"authentication_lvl\":\"";
        buffer2send += auths;
        buffer2send += "\"}";
        _webserver->send(code, "application/json", buffer2send);
    } else {
        if (auth_level != LEVEL_GUEST) {
            String cookie = _webserver->header("Cookie");
            int    pos    = cookie.indexOf("ESPSESSIONID=");
            String sessionID;
            if (pos != -1) {
                int pos2                   = cookie.indexOf(";", pos);
                sessionID                  = cookie.substring(pos + strlen("ESPSESSIONID="), pos2);
                auth_ip* current_auth_info = GetAuth(_webserver->client().remoteIP(), sessionID.c_str());
                if (current_auth_info != NULL) {
                    sUser = current_auth_info->userID;
                }
            }
        }
        String buffer2send = "{\"status\":\"200\",\"authentication_lvl\":\"";
        buffer2send += auths;
        buffer2send += "\",\"user\":\"";
        buffer2send += sUser;
        buffer2send += "\"}";
        _webserver->send(code, "application/json", buffer2send);
    }
#    else
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", "{\"status\":\"Ok\",\"authentication_lvl\":\"admin\"}");
#    endif
}
//SPIFFS
//SPIFFS files list and file commands
void Web_Server::handleFileList() {
    auth_t auth_level = is_authenticated();
    if (auth_level == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_NONE;
        _webserver->send(401, "text/plain", "Authentication failed!\n");
        return;
    }
    String path;
    String status = "Ok";
    if (_upload_status == UPLOAD_STATUS_FAILED) {
        status         = "Upload failed";
        _upload_status = UPLOAD_STATUS_NONE;
    }
    _upload_status = UPLOAD_STATUS_NONE;
    //be sure root is correct according authentication
    if (auth_level == LEVEL_ADMIN) {
        path = "/";
    } else {
        path = "/user";
    }
    //get current path
    if (_webserver->hasArg("path")) {
        path += _webserver->arg("path");
    }
    //to have a clean path
    path.trim();
    path.replace("//", "/");
    if (path[path.length() - 1] != '/') {
        path += "/";
    }
    //check if query need some action
    if (_webserver->hasArg("action")) {
        //delete a file
        if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            shortname.replace("/", "");
            filename = path + _webserver->arg("filename");
            filename.replace("//", "/");
            if (!SPIFFS.exists(filename)) {
                status = shortname + " does not exists!";
            } else {
                if (SPIFFS.remove(filename)) {
                    status = shortname + " deleted";
                    //what happen if no "/." and no other subfiles ?
                    String ptmp = path;
                    if ((path != "/") && (path[path.length() - 1] = '/')) {
                        ptmp = path.substring(0, path.length() - 1);
                    }
                    File dir        = SPIFFS.open(ptmp);
                    File dircontent = dir.openNextFile();
                    if (!dircontent) {
                        //keep directory alive even empty
                        File r = SPIFFS.open(path + "/.", FILE_WRITE);
                        if (r) {
                            r.close();
                        }
                    }
                } else {
                    status = "Cannot deleted ";
                    status += shortname;
                }
            }
        }
        //delete a directory
        if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            shortname.replace("/", "");
            filename = path + _webserver->arg("filename");
            filename += "/";
            filename.replace("//", "/");
            if (filename != "/") {
                bool delete_error = false;
                File dir          = SPIFFS.open(path + shortname);
                {
                    File file2deleted = dir.openNextFile();
                    while (file2deleted) {
                        String fullpath = file2deleted.name();
                        if (!SPIFFS.remove(fullpath)) {
                            delete_error = true;
                            status       = "Cannot deleted ";
                            status += fullpath;
                        }
                        file2deleted = dir.openNextFile();
                    }
                }
                if (!delete_error) {
                    status = shortname;
                    status += " deleted";
                }
            }
        }
        //create a directory
        if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename")) {
            String filename;
            filename         = path + _webserver->arg("filename") + "/.";
            String shortname = _webserver->arg("filename");
            shortname.replace("/", "");
            filename.replace("//", "/");
            if (SPIFFS.exists(filename)) {
                status = shortname + " already exists!";
            } else {
                File r = SPIFFS.open(filename, FILE_WRITE);
                if (!r) {
                    status = "Cannot create ";
                    status += shortname;
                } else {
                    r.close();
                    status = shortname + " created";
                }
            }
        }
    }
    String jsonfile = "{";
    String ptmp     = path;
    if ((path != "/") && (path[path.length() - 1] = '/')) {
        ptmp = path.substring(0, path.length() - 1);
    }
    File dir = SPIFFS.open(ptmp);
    jsonfile += "\"files\":[";
    bool   firstentry = true;
    String subdirlist = "";
    File   fileparsed = dir.openNextFile();
    while (fileparsed) {
        String filename  = fileparsed.name();
        String size      = "";
        bool   addtolist = true;
        //remove path from name
        filename = filename.substring(path.length(), filename.length());
        //check if file or subfile
        if (filename.indexOf("/") > -1) {
            //Do not rely on "/." to define directory as SPIFFS upload won't create it but directly files
            //and no need to overload SPIFFS if not necessary to create "/." if no need
            //it will reduce SPIFFS available space so limit it to creation
            filename   = filename.substring(0, filename.indexOf("/"));
            String tag = "*";
            tag += filename + "*";
            if (subdirlist.indexOf(tag) > -1 || filename.length() == 0) {  //already in list
                addtolist = false;                                         //no need to add
            } else {
                size = "-1";  //it is subfile so display only directory, size will be -1 to describe it is directory
                if (subdirlist.length() == 0) {
                    subdirlist += "*";
                }
                subdirlist += filename + "*";  //add to list
            }
        } else {
            //do not add "." file
            if (!((filename == ".") || (filename == ""))) {
                size = ESPResponseStream::formatBytes(fileparsed.size());
            } else {
                addtolist = false;
            }
        }
        if (addtolist) {
            if (!firstentry) {
                jsonfile += ",";
            } else {
                firstentry = false;
            }
            jsonfile += "{";
            jsonfile += "\"name\":\"";
            jsonfile += filename;
            jsonfile += "\",\"size\":\"";
            jsonfile += size;
            jsonfile += "\"";
            jsonfile += "}";
        }
        fileparsed = dir.openNextFile();
    }
    jsonfile += "],";
    jsonfile += "\"path\":\"" + path + "\",";
    jsonfile += "\"status\":\"" + status + "\",";
    size_t totalBytes;
    size_t usedBytes;
    totalBytes = SPIFFS.totalBytes();
    usedBytes  = SPIFFS.usedBytes();
    jsonfile += "\"total\":\"" + ESPResponseStream::formatBytes(totalBytes) + "\",";
    jsonfile += "\"used\":\"" + ESPResponseStream::formatBytes(usedBytes) + "\",";
    jsonfile.concat(F("\"occupation\":\""));
    jsonfile += String(100 * usedBytes / totalBytes);
    jsonfile += "\"";
    jsonfile += "}";
    path = "";
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", jsonfile);
    _upload_status = UPLOAD_STATUS_NONE;
}

//push error code and message to websocket
void Web_Server::pushError(int code, const char* st, bool web_error, uint16_t timeout) {
    if (_socket_server && st) {
        String s = "ERROR:" + String(code) + ":";
        s += st;
        _socket_server->sendTXT(_id_connection, s);
        if (web_error != 0) {
            if (_webserver) {
                if (_webserver->client().available() > 0) {
                    _webserver->send(web_error, "text/xml", st);
                }
            }
        }
        uint32_t t = millis();
        while (millis() - t < timeout) {
            _socket_server->loop();
            delay(10);
        }
    }
}

//abort reception of packages
void Web_Server::cancelUpload() {
    if (_webserver) {
        if (_webserver->client().available() > 0) {
            HTTPUpload& upload = _webserver->upload();
            upload.status      = UPLOAD_FILE_ABORTED;
            errno              = ECONNABORTED;
            _webserver->client().stop();
            delay(100);
        }
    }
}

//SPIFFS files uploader handle
void Web_Server::SPIFFSFileupload() {
    static String filename;
    static File   fsUploadFile = (File)0;
    //get authentication status
    auth_t auth_level = is_authenticated();
    //Guest cannot upload - only admin
    if (auth_level == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_FAILED;
        grbl_send(CLIENT_ALL, "[MSG:Upload rejected]\r\n");
        pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
    } else {
        HTTPUpload& upload = _webserver->upload();
        if ((_upload_status != UPLOAD_STATUS_FAILED) || (upload.status == UPLOAD_FILE_START)) {
            //Upload start
            //**************
            if (upload.status == UPLOAD_FILE_START) {
                _upload_status         = UPLOAD_STATUS_ONGOING;
                String upload_filename = upload.filename;
                if (upload_filename[0] != '/')
                    filename = "/" + upload_filename;
                else
                    filename = upload.filename;
                //according User or Admin the root is different as user is isolate to /user when admin has full access
                if (auth_level != LEVEL_ADMIN) {
                    upload_filename = filename;
                    filename        = "/user" + upload_filename;
                }

