bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
                if (SPIFFS.exists(filename)) {
                    SPIFFS.remove(filename);
                }
                if (fsUploadFile) {
                    fsUploadFile.close();
                }
                String sizeargname = upload.filename + "S";
                if (_webserver->hasArg(sizeargname.c_str())) {
                    uint32_t filesize  = _webserver->arg(sizeargname.c_str()).toInt();
                    uint32_t freespace = SPIFFS.totalBytes() - SPIFFS.usedBytes();
                    if (filesize > freespace) {
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                    }
                }
                if (_upload_status != UPLOAD_STATUS_FAILED) {
                    //create file
                    fsUploadFile = SPIFFS.open(filename, FILE_WRITE);
                    //check If creation succeed
                    if (fsUploadFile) {
                        //if yes upload is started
                        _upload_status = UPLOAD_STATUS_ONGOING;
                    } else {
                        //if no set cancel flag
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_FILE_CREATION, "File creation failed");
                    }
                }
                //Upload write
                //**************
            } else if (upload.status == UPLOAD_FILE_WRITE) {
                vTaskDelay(1 / portTICK_RATE_MS);
                //check if file is available and no error
                if (fsUploadFile && _upload_status == UPLOAD_STATUS_ONGOING) {
                    //no error so write post date
                    if (upload.currentSize != fsUploadFile.write(upload.buf, upload.currentSize)) {
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                } else {
                    //we have a problem set flag UPLOAD_STATUS_FAILED
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                    pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                }
                //Upload end
                //**************
            } else if (upload.status == UPLOAD_FILE_END) {
                //check if file is still open
                if (fsUploadFile) {
                    //close it
                    fsUploadFile.close();
                    //check size
                    String sizeargname = upload.filename + "S";
                    fsUploadFile       = SPIFFS.open(filename, FILE_READ);
                    uint32_t filesize  = fsUploadFile.size();
                    fsUploadFile.close();
                    if (_webserver->hasArg(sizeargname.c_str())) {
                        if (_webserver->arg(sizeargname.c_str()) != String(filesize)) {
                            _upload_status = UPLOAD_STATUS_FAILED;
                        }
                    }
                    if (_upload_status == UPLOAD_STATUS_ONGOING) {
                        _upload_status = UPLOAD_STATUS_SUCCESSFUL;
                    } else {
                        grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                        pushError(ESP_ERROR_UPLOAD, "File upload failed");
                    }
                } else {
                    //we have a problem set flag UPLOAD_STATUS_FAILED
                    _upload_status = UPLOAD_STATUS_FAILED;
                    pushError(ESP_ERROR_FILE_CLOSE, "File close failed");
                    grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                }
                //Upload cancelled
                //**************
            } else {
                _upload_status = UPLOAD_STATUS_FAILED;
                //pushError(ESP_ERROR_UPLOAD, "File upload failed");
                return;
            }
        }
    }

    if (_upload_status == UPLOAD_STATUS_FAILED) {
        cancelUpload();
        if (SPIFFS.exists(filename)) {
            SPIFFS.remove(filename);
        }
    }
    COMMANDS::wait(0);
}

//Web Update handler
void Web_Server::handleUpdate() {
    auth_t auth_level = is_authenticated();
    if (auth_level != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_NONE;
        _webserver->send(403, "text/plain", "Not allowed, log in first!\n");
        return;
    }
    String jsonfile = "{\"status\":\"";
    jsonfile += String(_upload_status);
    jsonfile += "\"}";
    //send status
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", jsonfile);
    //if success restart
    if (_upload_status == UPLOAD_STATUS_SUCCESSFUL) {
        COMMANDS::wait(1000);
        COMMANDS::restart_ESP();
    } else {
        _upload_status = UPLOAD_STATUS_NONE;
    }
}

//File upload for Web update
void Web_Server::WebUpdateUpload() {
    static size_t   last_upload_update;
    static uint32_t maxSketchSpace = 0;
    //only admin can update FW
    if (is_authenticated() != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_FAILED;
        grbl_send(CLIENT_ALL, "[MSG:Upload rejected]\r\n");
        pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
    } else {
        //get current file ID
        HTTPUpload& upload = _webserver->upload();
        if ((_upload_status != UPLOAD_STATUS_FAILED) || (upload.status == UPLOAD_FILE_START)) {
            //Upload start
            //**************
            if (upload.status == UPLOAD_FILE_START) {
                grbl_send(CLIENT_ALL, "[MSG:Update Firmware]\r\n");
                _upload_status     = UPLOAD_STATUS_ONGOING;
                String sizeargname = upload.filename + "S";
                if (_webserver->hasArg(sizeargname.c_str())) {
                    maxSketchSpace = _webserver->arg(sizeargname).toInt();
                }
                //check space
                size_t flashsize = 0;
                if (esp_ota_get_running_partition()) {
                    const esp_partition_t* partition = esp_ota_get_next_update_partition(NULL);
                    if (partition) {
                        flashsize = partition->size;
                    }
                }
                if (flashsize < maxSketchSpace) {
                    pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                }
                if (_upload_status != UPLOAD_STATUS_FAILED) {
                    last_upload_update = 0;
                    if (!Update.begin()) {  //start with max available size
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update cancelled]\r\n");
                        pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                    } else {
                        grbl_send(CLIENT_ALL, "\n[MSG:Update 0%]\r\n");
                    }
                }
                //Upload write
                //**************
            } else if (upload.status == UPLOAD_FILE_WRITE) {
                vTaskDelay(1 / portTICK_RATE_MS);
                //check if no error
                if (_upload_status == UPLOAD_STATUS_ONGOING) {
                    if (((100 * upload.totalSize) / maxSketchSpace) != last_upload_update) {
                        if (maxSketchSpace > 0)
                            last_upload_update = (100 * upload.totalSize) / maxSketchSpace;
                        else
                            last_upload_update = upload.totalSize;
                        String s = "Update ";
                        s += String(last_upload_update);
                        s += "%";
                        grbl_sendf(CLIENT_ALL, "[MSG:%s]\r\n", s.c_str());
                    }
                    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Update write failed]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                }
                //Upload end
                //**************
            } else if (upload.status == UPLOAD_FILE_END) {
                if (Update.end(true)) {  //true to set the size to the current progress
                    //Now Reboot
                    grbl_send(CLIENT_ALL, "[MSG:Update 100%]\r\n");
                    _upload_status = UPLOAD_STATUS_SUCCESSFUL;
                } else {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                    pushError(ESP_ERROR_UPLOAD, "Update upload failed");
                }
            } else if (upload.status == UPLOAD_FILE_ABORTED) {
                grbl_send(CLIENT_ALL, "[MSG:Update failed]\r\n");
                _upload_status = UPLOAD_STATUS_FAILED;
                return;
            }
        }
    }
    if (_upload_status == UPLOAD_STATUS_FAILED) {
        cancelUpload();
        Update.end();
    }
    COMMANDS::wait(0);
}

#    ifdef ENABLE_SD_CARD

//Function to delete not empty directory on SD card
bool Web_Server::deleteRecursive(String path) {
    bool result = true;
    File file   = SD.open((char*)path.c_str());
    //failed
    if (!file) {
        return false;
    }
    if (!file.isDirectory()) {
        file.close();
        //return if success or not
        return SD.remove((char*)path.c_str());
    }
    file.rewindDirectory();
    while (true) {
        File entry = file.openNextFile();
        if (!entry) {
            break;
        }
        String entryPath = entry.name();
        if (entry.isDirectory()) {
            entry.close();
            if (!deleteRecursive(entryPath)) {
                result = false;
            }
        } else {
            entry.close();
            if (!SD.remove((char*)entryPath.c_str())) {
                result = false;
                break;
            }
        }
        COMMANDS::wait(0);  //wdtFeed
    }
    file.close();
    if (result)
        return SD.rmdir((char*)path.c_str());
    else
        return false;
}

