bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
//direct SD files list//////////////////////////////////////////////////
void Web_Server::handle_direct_SDFileList() {
    //this is only for admin and user
    if (is_authenticated() == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_NONE;
        _webserver->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
        return;
    }

    String path    = "/";
    String sstatus = "Ok";
    if ((_upload_status == UPLOAD_STATUS_FAILED) || (_upload_status == UPLOAD_STATUS_FAILED)) {
        sstatus        = "Upload failed";
        _upload_status = UPLOAD_STATUS_NONE;
    }
    bool     list_files = true;
    uint64_t totalspace = 0;
    uint64_t usedspace  = 0;
    if (get_sd_state(true) != SDCARD_IDLE) {
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", "{\"status\":\"No SD Card\"}");
        return;
    }
    set_sd_state(SDCARD_BUSY_PARSING);
    //get current path
    if (_webserver->hasArg("path")) {
        path += _webserver->arg("path");
    }
    //to have a clean path
    path.trim();
    path.replace("//", "/");
    if (path[path.length() - 1] != '/') {
        path += "/";
    }
    //check if query need some action
    if (_webserver->hasArg("action")) {
        //delete a file
        if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            filename         = path + shortname;
            shortname.replace("/", "");
            filename.replace("//", "/");
            if (!SD.exists((char*)filename.c_str())) {
                sstatus = shortname + " does not exist!";
            } else {
                if (SD.remove((char*)filename.c_str())) {
                    sstatus = shortname + " deleted";
                } else {
                    sstatus = "Cannot deleted ";
                    sstatus += shortname;
                }
            }
        }
        //delete a directory
        if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            shortname.replace("/", "");
            filename = path + "/" + shortname;
            filename.replace("//", "/");
            if (filename != "/") {
                if (!SD.exists((char*)filename.c_str())) {
                    sstatus = shortname + " does not exist!";
                } else {
                    if (!deleteRecursive(filename)) {
                        sstatus = "Error deleting: ";
                        sstatus += shortname;
                    } else {
                        sstatus = shortname;
                        sstatus += " deleted";
                    }
                }
            } else {
                sstatus = "Cannot delete root";
            }
        }
        //create a directory
        if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            filename         = path + shortname;
            shortname.replace("/", "");
            filename.replace("//", "/");
            if (SD.exists((char*)filename.c_str())) {
                sstatus = shortname + " already exists!";
            } else {
                if (!SD.mkdir((char*)filename.c_str())) {
                    sstatus = "Cannot create ";
                    sstatus += shortname;
                } else {
                    sstatus = shortname + " created";
                }
            }
        }
    }
    //check if no need build file list
    if (_webserver->hasArg("dontlist")) {
        if (_webserver->arg("dontlist") == "yes") {
            list_files = false;
        }
    }
    // TODO Settings - consider using the JSONEncoder class
    String jsonfile = "{";
    jsonfile += "\"files\":[";

    if (path != "/")
        path = path.substring(0, path.length() - 1);
    if (path != "/" && !SD.exists((char*)path.c_str())) {
        String s = "{\"status\":\" ";
        s += path;
        s += " does not exist on SD Card\"}";
        _webserver->send(200, "application/json", s.c_str());
        return;
    }
    if (list_files) {
        File dir = SD.open((char*)path.c_str());
        if (!dir) {}
        if (!dir.isDirectory()) {
            dir.close();
        }
        dir.rewindDirectory();
        File entry = dir.openNextFile();
        int  i     = 0;
        while (entry) {
            COMMANDS::wait(1);
            if (i > 0) {
                jsonfile += ",";
            }
            jsonfile += "{\"name\":\"";
            String tmpname = entry.name();
            int    pos     = tmpname.lastIndexOf("/");
            tmpname        = tmpname.substring(pos + 1);
            jsonfile += tmpname;
            jsonfile += "\",\"shortname\":\"";  //No need here
            jsonfile += tmpname;
            jsonfile += "\",\"size\":\"";
            if (entry.isDirectory()) {
                jsonfile += "-1";
            } else {
                // files have sizes, directories do not
                jsonfile += ESPResponseStream::formatBytes(entry.size());
            }
            jsonfile += "\",\"datetime\":\"";
            //TODO - can be done later
            jsonfile += "\"}";
            i++;
            entry.close();
            entry = dir.openNextFile();
        }
        dir.close();
    }
    jsonfile += "],\"path\":\"";
    jsonfile += path + "\",";
    jsonfile += "\"total\":\"";
    String stotalspace, susedspace;
    //SDCard are in GB or MB but no less
    totalspace  = SD.totalBytes();
    usedspace   = SD.usedBytes();
    stotalspace = ESPResponseStream::formatBytes(totalspace);
    susedspace  = ESPResponseStream::formatBytes(usedspace + 1);

    uint32_t occupedspace = 1;
    uint32_t usedspace2   = usedspace / (1024 * 1024);
    uint32_t totalspace2  = totalspace / (1024 * 1024);
    occupedspace          = (usedspace2 * 100) / totalspace2;
    //minimum if even one byte is used is 1%
    if (occupedspace <= 1) {
        occupedspace = 1;
    }
    if (totalspace) {
        jsonfile += stotalspace;
    } else {
        jsonfile += "-1";
    }
    jsonfile += "\",\"used\":\"";
    jsonfile += susedspace;
    jsonfile += "\",\"occupation\":\"";
    if (totalspace) {
        jsonfile += String(occupedspace);
    } else {
        jsonfile += "-1";
    }
    jsonfile += "\",";
    jsonfile += "\"mode\":\"direct\",";
    jsonfile += "\"status\":\"";
    jsonfile += sstatus + "\"";
    jsonfile += "}";
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", jsonfile.c_str());
    _upload_status = UPLOAD_STATUS_NONE;
    set_sd_state(SDCARD_IDLE);
}

//SD File upload with direct access to SD///////////////////////////////
void Web_Server::SDFile_direct_upload() {
    static String filename;
    static File   sdUploadFile;
    //this is only for admin and user
    if (is_authenticated() == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_FAILED;
        _webserver->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
        pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
    } else {
        //retrieve current file id
        HTTPUpload& upload = _webserver->upload();
        if ((_upload_status != UPLOAD_STATUS_FAILED) || (upload.status == UPLOAD_FILE_START)) {
            //Upload start
            //**************
            if (upload.status == UPLOAD_FILE_START) {
                _upload_status = UPLOAD_STATUS_ONGOING;
                filename       = upload.filename;
                //on SD need to add / if not present
                if (filename[0] != '/') {
                    filename = "/" + upload.filename;
                }
                //check if SD Card is available
                if (get_sd_state(true) != SDCARD_IDLE) {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                    pushError(ESP_ERROR_UPLOAD_CANCELLED, "Upload cancelled");

                } else {
                    set_sd_state(SDCARD_BUSY_UPLOADING);
                    //delete file on SD Card if already present
                    if (SD.exists((char*)filename.c_str())) {
                        SD.remove((char*)filename.c_str());
                    }
                    String sizeargname = upload.filename + "S";
                    if (_webserver->hasArg(sizeargname.c_str())) {
                        uint32_t filesize  = _webserver->arg(sizeargname.c_str()).toInt();
                        uint64_t freespace = SD.totalBytes() - SD.usedBytes();
                        if (filesize > freespace) {
                            _upload_status = UPLOAD_STATUS_FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                            pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space");
                        }
                    }
                    if (_upload_status != UPLOAD_STATUS_FAILED) {
                        //Create file for writing
                        sdUploadFile = SD.open((char*)filename.c_str(), FILE_WRITE);
                        //check if creation succeed
                        if (!sdUploadFile) {
                            //if creation failed
                            _upload_status = UPLOAD_STATUS_FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            pushError(ESP_ERROR_FILE_CREATION, "File creation failed");
                        }
                        //if creation succeed set flag UPLOAD_STATUS_ONGOING
                        else {
                            _upload_status = UPLOAD_STATUS_ONGOING;
                        }
                    }
                }
                //Upload write
                //**************
            } else if (upload.status == UPLOAD_FILE_WRITE) {
                vTaskDelay(1 / portTICK_RATE_MS);
                if (sdUploadFile && (_upload_status == UPLOAD_STATUS_ONGOING) && (get_sd_state(false) == SDCARD_BUSY_UPLOADING)) {
                    //no error write post data
                    if (upload.currentSize != sdUploadFile.write(upload.buf, upload.currentSize)) {
                        _upload_status = UPLOAD_STATUS_FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                    }
                } else {  //if error set flag UPLOAD_STATUS_FAILED
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                    pushError(ESP_ERROR_FILE_WRITE, "File write failed");
                }
                //Upload end
                //**************
            } else if (upload.status == UPLOAD_FILE_END) {
                //if file is open close it
                if (sdUploadFile) {
                    sdUploadFile.close();
                    //TODO Check size
                    String sizeargname = upload.filename + "S";
                    if (_webserver->hasArg(sizeargname.c_str())) {
                        uint32_t filesize = 0;
                        sdUploadFile      = SD.open(filename.c_str(), FILE_READ);
                        filesize          = sdUploadFile.size();
                        sdUploadFile.close();
                        if (_webserver->arg(sizeargname.c_str()) != String(filesize)) {
                            _upload_status = UPLOAD_STATUS_FAILED;
                            pushError(ESP_ERROR_UPLOAD, "File upload mismatch");
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        }
                    }
                } else {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                    pushError(ESP_ERROR_FILE_CLOSE, "File close failed");
                }
                if (_upload_status == UPLOAD_STATUS_ONGOING) {
                    _upload_status = UPLOAD_STATUS_SUCCESSFUL;
                    set_sd_state(SDCARD_IDLE);
                } else {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    pushError(ESP_ERROR_UPLOAD, "Upload error");
                }

            } else {  //Upload cancelled
                _upload_status = UPLOAD_STATUS_FAILED;
                set_sd_state(SDCARD_IDLE);
                grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                if (sdUploadFile) {
                    sdUploadFile.close();
                }
                return;
            }
        }
    }
    if (_upload_status == UPLOAD_STATUS_FAILED) {
        cancelUpload();
        if (sdUploadFile) {
            sdUploadFile.close();
        }
        if (SD.exists((char*)filename.c_str())) {
            SD.remove((char*)filename.c_str());
        }
        set_sd_state(SDCARD_IDLE);
    }
    COMMANDS::wait(0);
}
#    endif

void Web_Server::handle() {
    static uint32_t timeout = millis();
    COMMANDS::wait(0);
#    ifdef ENABLE_CAPTIVE_PORTAL
    if (WiFi.getMode() == WIFI_AP) {
        dnsServer.processNextRequest();
    }
#    endif
    if (_webserver)
        _webserver->handleClient();
    if (_socket_server && _setupdone)
        _socket_server->loop();
    if ((millis() - timeout) > 10000) {
        if (_socket_server) {
            String s = "PING:";
            s += String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout = millis();
        }
    }
}

void Web_Server::handle_Websocket_Event(uint8_t num, uint8_t type, uint8_t* payload, size_t length) {
    switch (type) {
        case WStype_DISCONNECTED:
            //USE_SERIAL.printf("[%u] Disconnected!\n", num);
            break;
        case WStype_CONNECTED: {
            IPAddress ip = _socket_server->remoteIP(num);
            //USE_SERIAL.printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
            String s = "CURRENT_ID:" + String(num);
            // send message to client
            _id_connection = num;
            _socket_server->sendTXT(_id_connection, s);
            s = "ACTIVE_ID:" + String(_id_connection);
            _socket_server->broadcastTXT(s);
        } break;
        case WStype_TEXT:
            //USE_SERIAL.printf("[%u] get Text: %s\n", num, payload);

            // send message to client
            // webSocket.sendTXT(num, "message here");

